In [6]:
#Imports
import pandas as pd
import pyodbc
import numpy as np

In [3]:
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=localhost;'
                      'Database=Training;'
                      'Trusted_Connection=yes;')

cursor = conn.cursor()
cursor.execute('SELECT * FROM Training.dbo.Person')

for row in cursor:
    print(row)

('Bwalya', 10, 'Lusaka    ')
('Mulenga', 15, 'Lusaka    ')
('Mercy', 9, 'Kitwe     ')
('Bupe', 7, 'Chingola  ')
('Gwen', 8, 'Choma     ')

In [4]:
df = pd.read_sql_query("SELECT * FROM person", conn)

In [5]:
df

      Name  Age        City
0   Bwalya   10  Lusaka
1  Mulenga   15  Lusaka
2    Mercy    9  Kitwe
3     Bupe    7  Chingola
4     Gwen    8  Choma

Sort by alphabetical order

In [8]:
df.sort_values(by='Name')

      Name  Age        City
3     Bupe    7  Chingola
0   Bwalya   10  Lusaka
4     Gwen    8  Choma
2    Mercy    9  Kitwe
1  Mulenga   15  Lusaka

In [9]:
df.sort_values(by='Name', ascending=False)

      Name  Age        City
1  Mulenga   15  Lusaka
2    Mercy    9  Kitwe
4     Gwen    8  Choma
0   Bwalya   10  Lusaka
3     Bupe    7  Chingola

In [10]:
df.sort_values(by='Age')

      Name  Age        City
3     Bupe    7  Chingola
4     Gwen    8  Choma
2    Mercy    9  Kitwe
0   Bwalya   10  Lusaka
1  Mulenga   15  Lusaka

In [11]:
df.sort_values(by=['City','Name'])

      Name  Age        City
3     Bupe    7  Chingola
4     Gwen    8  Choma
2    Mercy    9  Kitwe
0   Bwalya   10  Lusaka
1  Mulenga   15  Lusaka